Repository: DaviMontiel/my-portfolio
Catalog: lib/l10n/app_*.arb
Languages: es

# welcomeTitle
source: Welcome
es: Bienvenido

# job0
source: Multiplatform Developer
es: Desarrollador Multiplataforma

# job1
source: Proyect Manager
es: Coordinador de Proyectos

# job2
source: App Designer
es: Diseñador de Apps

# manPageText0
source: Can I help you?
es: ¿Puedo ayudarte?

# manPageText1
source: Let's work?
es: ¿Trabajamos?

# manPageBtn0
source: Contact me
es: Contáctame

# manPageText2_0
source: know
es: conoce

# manPageText2_1
source: my work
es: mi trabajo

# manPageText3_0
source: about
es: sobre

# manPageText3_1
source: me
es: mi

# manPageText4_0
source: where
es: de

# manPageText4_1
source: I am
es: donde soy

# manPageContactMail
source: Email
es: Correo

# manPageContactTel
source: Phone
es: Teléfono

# aboutMeTitle
source: About me
es: Sobre mi

# aboutMeSection0
source: Hello
es: Hola

# aboutMeSection1
source: Experience
es: Trabajos

# aboutMeSection2
source: Academic
es: Estudios

# aboutMeSection3
source: Skills
es: Aptitudes

# helloTitle
source: Hello, I am David!
es: ¡Hola, Soy David!

# helloText0
source: A passionate software developer with experience in native application development and information systems. I was born in Málaga (Spain) and have been interested in technology and programming since I was young.
es: Un apasionado desarrollador de software con experiencia en el desarrollo de aplicaciones nativas y sistemas informaticos. Nací en Málaga (España) y desde joven me interesé por la tecnología y la programación.

# helloText1
source: I have worked on several projects, serving as the Lead Coordinator and Full Stack Developer. I love learning about new technologies and facing challenges that allow me to grow professionally.
es: He trabajado en varios proyectos, siendo el Coordinador principal y Desarrollador Full Stack. Me encanta aprender sobre nuevas tecnologías y enfrentar desafíos que me permitan crecer profesionalmente.

# experienceYearPresent
source: Present
es: Presente

# experienceJob0Title
source: Full Stack Developer
es: Desarrollador Full Stack

# experienceJob0Content
source: Currently, I work as a Proyect Manager and Full Stack Developer, creating native applications, websites, and services such as brokers, APIs, and database management systems (DBMS). Some of my projects:
es: Actualmente, trabajo como Coodinador de proyectos y Desarrollador Full Stack, creando aplicaciones nativas, páginas web y servicios como brokers, APIs y sistemas de gestión de bases de datos. Algunos de mis proyectos:

# experienceJob0App0Content
source: An application that interacts with physical stations allowing the parking and charging of scooters or bicycles. I was responsible for the complete development of the app, API, web, database management system, and infrastructure. Some of the resources used were: Flutter, Firebase, .NET, MQTT, SQL Server, Azure ...
es: Aplicación que interactua con estaciones físicas permitiendo aparcar y cargar patinetes o bicicletas. Me encargué del desarrollo completo de la app, API, web, SGBD y de la infraestructura. Algunos de los recursos utilizados fueron: Flutter, Firebase, .NET, MQTT, SQLServer, Azure ...

# experienceJob0App1Content
source: An application that optimizes water consumption in facilities such as homes and buildings. I coordinated the project development, correcting and implementing new features while utilizing different task management methods for the team. Some of the resources used were: Flutter, Firebase, NestJS, MQTT, Angular, MySQL, AWS ...
es: Aplicación que optimiza el consumo de agua en instalaciones como casas y edificios. Coordiné el desarrollo del proyecto, corriguiendo e implantando nuevas caracteristicas y utilizando diferentes métodos de gestión de tareas para el equipo. Algunos de los recursos utilizados fueron: Flutter, Firebase, NestJS, MQTT, Angular, MySQL, AWS ...

# experienceJob1Title
source: Computer Systems Technician
es: Técnico en Sistemas Informáticos

# experienceJob1Content
source: At Vivatech, I worked as a Computer Technician, focusing on the repair of computers, laptops, and tablets. My role involved diagnosing and troubleshooting both software and hardware issues, ensuring that the devices operated efficiently.
es: En Vivatech, trabajé como Técnico en Sistemas Informáticos, centrándome en la reparación de computadoras, laptops y tablets. Mi rol incluía diagnosticar y solucionar problemas tanto de software como de hardware, asegurando que los dispositivos funcionaran de manera eficiente.

# academicStudy1Name
source: Higher Vocational Training Degree, Multiplatform Application Development
es: Ciclo Formativo de Grado Superior, Desarrollo de aplicaciones Multiplataforma

# academicStudy2Name
source: Intermediate Vocational Training Degree, Microcomputer Systems and Networks
es: Ciclo Formativo de Grado Medio, Sistemas Microinformáticos y Redes

# academicStudy3Name
source: Compulsory Secondary Education (ESO)
es: Educación Secundaria Obligatoria (ESO)

# academicStudyGrade
source: Grade:
es: Nota:

# skillsText0
source: +--------------------------------------+ | Developer Skills | |--------------------------------------| | • Agile Development | | • Frameworks: | | Flutter, Angular, NestJS. | | • UI/UX Design | | • Programming: | | Java, Kotlin, Dart, C, C++, C#, | | PHP, TypeScript, Python... | | • Databases: | | MariaDB, MySQL, SQLite, PostgreSQL| | • Version Control: | | Git, GitHub, Bitbucket. | | • APIs (RESTful, GraphQL) | | • Software Testing | | • Continuous Integration (CI/CD) | | • Problem Solving | | • Collaboration | | • Adaptability | | • Methodologies (TDD, Backlog) | | • Security | |--------------------------------------| | [ Close ] [ Save Changes ] | +--------------------------------------+
es: +--------------------------------------+ | Aptitudes del Desarrollador | |---------------------------- ---------| | • Desarrollo ágil | | • Frameworks: | | Flutter, Angular, NestJS. | | • Diseño UI/UX | | • Programación: | | Java, Kotlin, Dart, C, C++, C#, | | PHP, TypeScript, Python... | | • Bases de datos: | | MariaDB, MySQL, SQLite, PostgreSQL| | • Control de versiones: | | Git, GitHub, Bitbucket. | | • APIs (RESTful, GraphQL) | | • Pruebas de software | | • Integración continua (CI/CD) | | • Solución de problemas | | • Colaboración | | • Adaptabilidad | | • Metodologías (TDD, Backlog) | | • Seguridad | |--------------------------------------| | [ Cerrar ] [ Guardar Cambios ] | +--------------------------------------+
